public class Annotation {
  /*
  객체의 4가지 특징
    1.캡슐화(정보은닉)
    1.상속
    -공통기능을 묶어서 관리
    1.추상화
    -각 기능과 속성만을 따와 묶어 관리하는것(추상클래스, 인터페이스)
    1.다형성
    -같은 이름이지만 다른 기능 가능(오버라이딩, 오버로딩)

  추상메소드(abstract:앱스트랩스)
  추상메소드는 내부 기능을 구현하지 않고, 이름과 속성을 선언만 한 메소드이다.
  이후 상속받거나, 심어진곳에서 내부 기능 구현을 해주어야만 한다.(강제)

  추상클래스와 인터페이스
  인터페이스란 변수를 수정하거나 생성하지 않고,(상수고정)
  임플리먼츠 된 파일에서 인터페이스 내부에 작성된 모든 클래스를 작성해야만 한다.
  여러개 삽입 가능.

추상클래스는 변수를 수정하거나 생성할수 있고,
익스텐드(상속) 된 파일에서 추상 클래스 내부에 작성된 추상메소드들만 구현한다.

파라미터와 아규먼츠
파라미터는 매개변수의 터. 아규먼츠는 매개변수의 값.





  */


}
